app/Controllers/Admin/Extras.php

SELECT *
FROM "extras"
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "extras"
---
    public function index () {

        $data = [
            'titulo' => 'Listando os extras de produtos',
            'extras' => $this->extraModel->withDeleted(true)->paginate(10),