app/Controllers/Admin/Produtos.php

SELECT "produtos".*, "categorias"."nome" AS "categoria"
FROM "produtos"
JOIN "categorias" ON "categorias"."id" = "produtos"."categoria_id"
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "produtos"
JOIN "categorias" ON "categorias"."id" = "produtos"."categoria_id"
---
    public function index() {

        $data = [
            'titulo' => 'Listando os produtos',
            'produtos' => $this->produtoModel->select('produtos.*, categorias.nome AS categoria')
                    ->join('categorias', 'categorias.id = produtos.categoria_id')
                    ->withDeleted(true)
                    ->paginate(10),

SELECT "produtos".*, "categorias"."nome" AS "categoria"
FROM "produtos"
JOIN "categorias" ON "categorias"."id" = "produtos"."categoria_id"
WHERE "produtos"."id" = '8' AND "produtos"."deletado_em" is null
AND "produtos"."deletado_em" IS NULL
 LIMIT 1
---
    private function buscaProdutoOu404(int $id = null){

        if(!$id || !$produto = $this->produtoModel->select('produtos.*, categorias.nome AS categoria')
                                                  ->join('categorias','categorias.id = produtos.categoria_id')
                                                  ->where("produtos.id='$id' AND produtos.deletado_em is null")
                                                  ->first()){