app/Controllers/Admin/Produtos.php

    private function buscaProdutoOu404(int $id = null){

        if(!$id || !$produto = $this->produtoModel->select('produtos.*, categorias.nome AS categoria')
                                                  ->join('categorias','categorias.id = produtos.categoria_id')
                                                  ->where("produtos.id='$id' AND produtos.deletado_em is null")
                                                  ->first()){
---
SELECT "produtos".*, "categorias"."nome" AS "categoria"
FROM "produtos"
JOIN "categorias" ON "categorias"."id" = "produtos"."categoria_id"
WHERE "produtos"."id" = '8' AND "produtos"."deletado_em" is null
AND "produtos"."deletado_em" IS NULL
 LIMIT 1