app/Controllers/Admin/Usuarios.php

    public function index() {


        $data = [
            'titulo' => 'Listando os usuários',
            'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(10),
---
SELECT *
FROM "usuarios"
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "usuarios"

            }


            if ($this->usuarioModel->protect('f')->save($usuario)) {
---
UPDATE "usuarios" SET "is_admin" = '0', "ativo" = '1', "atualizado_em" = '2022-02-17 08:48:26'
WHERE "usuarios"."id" IN ('1')

    private function buscaUsuarioOu404(int $id = null) {

        if (!$id || !$usuario = $this->usuarioModel->withDeleted(true)->where('id', $id)->first()) {
---
SELECT *
FROM "usuarios"
WHERE "id" = 12
GROUP BY "usuarios"."id"
ORDER BY "usuarios"."id" ASC
 LIMIT 1