app/Controllers/Produto.php

SELECT *
FROM "produtos"
WHERE "slug" = 'pizza-de-frango-com-catupiry'
AND "ativo" = TRUE
AND "produtos"."deletado_em" IS NULL
 LIMIT 1
---
    public function detalhes(string $produto_slug = null) {

        if(!$produto_slug || !$produto = $this->produtoModel->where('slug', $produto_slug)->where('ativo', true)->first()) {

SELECT *
FROM "produtos"
WHERE "slug" = 'pizza-calabresa'
AND "ativo" = 't'
AND "produtos"."deletado_em" IS NULL
 LIMIT 1
---
    public function customizar (string $produto_slug = null) {

        if(!$produto_slug || !$produto = $this->produtoModel->where('slug', $produto_slug)->where('ativo', 't')->first()) {