app/Controllers/Produto.php

SELECT *
FROM "produtos"
WHERE "slug" = 'pizza-nordestina'
AND "ativo" = TRUE
AND "produtos"."deletado_em" IS NULL
 LIMIT 1
---
    public function detalhes(string $produto_slug = null) {

        if(!$produto_slug || !$produto = $this->produtoModel->where('slug', $produto_slug)->where('ativo', true)->first()) {