app/Models/ProdutoModel.php

SELECT "id", "nome"
FROM "produtos"
WHERE "nome" LIKE '%sd=%' ESCAPE '!'
---
    public function procurar($term) {

        if ($term === null) {

            return [];
        }


        return $this->select('id, nome')
                        ->like('nome', $term)
                        ->withDeleted(true)
                        ->get()
                        ->getResult();

SELECT "produtos".*, "categorias"."nome" AS "categoria"
FROM "produtos"
JOIN "categorias" ON "categorias"."id" = "produtos"."categoria_id"
WHERE "produtos"."id" = '7'
---
    public function buscaProdutoOu404(int $id = null){

        if(!$id || !$produto = $this->db->table('produtos')
                                                    ->select('produtos.*, categorias.nome AS categoria')
                                                    ->join('categorias','categorias.id = produtos.categoria_id')
                                                    ->where("produtos.id='$id'")
                                                    ->get()
                                                    ->getResult()){

SELECT "produtos"."id", "produtos"."nome"
FROM "produtos"
LEFT JOIN "produtos_especificacoes" ON "produtos_especificacoes"."produto_id" = "produtos"."id"
WHERE "produtos"."categoria_id" = 1
AND "produtos"."ativo" = TRUE
AND "produtos_especificacoes"."customizavel" = TRUE
---
    public function exibeOpcoesProdutosParaCustomizar(int $categoria_id) {

        return $this->select('produtos.id, produtos.nome')
                        ->join('produtos_especificacoes', 'produtos_especificacoes.produto_id = produtos.id')
                        ->where('produtos.categoria_id', $categoria_id)
                        ->where('produtos.ativo', true)
                        ->where('produtos_especificacoes.customizavel', true)
                        ->findAll();