app/Models/ProdutoEspecificacaoModel.php

SELECT "medidas"."nome" AS "medida", "produtos_especificacoes".*
FROM "produtos_especificacoes"
JOIN "medidas" ON "medidas"."id" = "produtos_especificacoes"."medida_id"
JOIN "produtos" ON "produtos"."id" = "produtos_especificacoes"."produto_id"
WHERE "produtos_especificacoes"."produto_id" = 11
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "produtos_especificacoes"
JOIN "medidas" ON "medidas"."id" = "produtos_especificacoes"."medida_id"
JOIN "produtos" ON "produtos"."id" = "produtos_especificacoes"."produto_id"
WHERE "produtos_especificacoes"."produto_id" = 11
---
    public function buscarEspecificacoesDoProduto(int $produto_id, int $quantidade_paginacao) {

        return $this->select('medidas.nome AS medida, produtos_especificacoes.*')
                     ->join('medidas', 'medidas.id = produtos_especificacoes.medida_id')
                     ->join('produtos', 'produtos.id = produtos_especificacoes.produto_id')
                     ->where('produtos_especificacoes.produto_id', $produto_id)
                     ->paginate($quantidade_paginacao);

SELECT "medidas"."nome", "produtos_especificacoes"."id" AS "especificacao_id", "produtos_especificacoes"."preco", "produtos_especificacoes"."customizavel"
FROM "produtos_especificacoes"
JOIN "medidas" ON "medidas"."id" = "produtos_especificacoes"."medida_id"
JOIN "produtos" ON "produtos"."id" = "produtos_especificacoes"."produto_id"
WHERE "produtos_especificacoes"."produto_id" = 11
---
    public function buscarEspecificacoesDoProdutoDetalhes(int $produto_id) {

            return $this->select('medidas.nome, produtos_especificacoes.id AS especificacao_id, produtos_especificacoes.preco')
                            ->join('medidas', 'medidas.id = produtos_especificacoes.medida_id')
                            ->join('produtos', 'produtos.id = produtos_especificacoes.produto_id')
                            ->where('produtos_especificacoes.produto_id', $produto_id)
                            ->findAll();